results/node2-raid-fix-memdisk-ceiling-20260709/full-memdisk/jfs-cold/fio-multi-seqread.txt
multi-seqread: (g=0): rw=read, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
...
fio-3.28
Starting 16 processes
multi-seqread: Laying out IO file (1 file / 4096MiB)
multi-seqread: Laying out IO file (1 file / 4096MiB)
multi-seqread: Laying out IO file (1 file / 4096MiB)
[...]

multi-seqread: (groupid=0, jobs=16): err= 0: pid=3744745: Thu Jul  9 00:01:54 2026
  read: IOPS=444, BW=111MiB/s (117MB/s)(64.0GiB/589571msec)
    clat (usec): min=33, max=584852, avg=35850.88, stdev=90598.18
     lat (usec): min=33, max=584852, avg=35851.17, stdev=90598.18
    clat percentiles (usec):
     |  1.00th=[   165],  5.00th=[   208], 10.00th=[   229], 20.00th=[   265],
     | 30.00th=[   310], 40.00th=[   383], 50.00th=[   478], 60.00th=[   578],
     | 70.00th=[  2573], 80.00th=[ 21890], 90.00th=[124257], 95.00th=[299893],
     | 99.00th=[396362], 99.50th=[413139], 99.90th=[450888], 99.95th=[463471],
     | 99.99th=[488637]
   bw (  KiB/s): min=43008, max=318496, per=100.00%, avg=114214.99, stdev=2262.40, samples=18781
   iops        : min=  168, max= 1244, avg=446.11, stdev= 8.84, samples=18781
  lat (usec)   : 50=0.01%, 100=0.07%, 250=16.16%, 500=36.65%, 750=13.06%
  lat (usec)   : 1000=1.25%
  lat (msec)   : 2=2.61%, 4=0.73%, 10=4.26%, 20=4.62%, 50=5.92%
  lat (msec)   : 100=3.67%, 250=4.23%, 500=6.77%, 750=0.01%
  cpu          : usr=0.02%, sys=0.69%, ctx=326524, majf=0, minf=3373
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=262144,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=111MiB/s (117MB/s), 111MiB/s-111MiB/s (117MB/s-117MB/s), io=64.0GiB (68.7GB), run=589571-589571msec